tap "homebrew/bundle"
tap "homebrew/services"
brew "libunistring"
brew "gmp"
brew "openssl@3"
brew "cask"
brew "cmake"
brew "cmake-docs"
brew "deno"
brew "dotnet", link: false
brew "duti"
brew "gh"
brew "go"
brew "handbrake", link: false
brew "icu4c@76"
brew "libyaml"
brew "llvm"
brew "neovim"
brew "node"
brew "nvm"
brew "pkgconf"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "raylib"
brew "starship"
brew "zig"
cask "bartender"
cask "chatgpt-atlas"
cask "daisydisk"
cask "dotnet-runtime"
cask "fantastical"
cask "gifox"
cask "github"
cask "godot"
cask "handbrake-app"
cask "hiddenbar"
cask "iterm2"
cask "itsycal"
cask "miniconda"
cask "obsidian"
cask "raycast"
cask "superwhisper"
cask "ticktick"
cask "todoist-app"
cask "warp"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "haxefoundation.haxe-hl"
vscode "kleber-swf.unity-code-snippets"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.autopep8"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-powertoys"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-copilot-data-analysis"
vscode "nadako.vshaxe"
vscode "openai.openai-chatgpt-adhoc"
vscode "prisma.prisma"
vscode "rangav.vscode-thunder-client"
vscode "rust-lang.rust-analyzer"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "vadimcn.vscode-lldb"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vshaxe.haxe-debug"
vscode "vshaxe.haxe-extension-pack"
vscode "vshaxe.hxcpp-debugger"
vscode "wiggin77.codedox"
vscode "xaver.clang-format"
